export type MockHelpfulProgramsType = {
  eating: string;
  lifestyle: string;
};

export type MockResultType = {
  id: number;
  date: string;
  time: string;
  score: number;
  percentage: number;
  diagnosis: string;
  helpfulPrograms: MockHelpfulProgramsType;
};

export const MOCK_RESULTS: MockResultType[] = [
  {
    id: 1,
    date: '2024년 5월 15일 (수)',
    time: '13:56분',
    score: 24,
    percentage: 73,
    diagnosis: `본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다.`,
    helpfulPrograms: {
      eating: `본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다`,
      lifestyle: `본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다.`,
    },
  },
  {
    id: 2,
    date: '2024년 5월 15일 (수)',
    time: '13:56분',
    score: 24,
    percentage: 73,
    diagnosis: `본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다.`,
    helpfulPrograms: {
      eating: `본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다`,
      lifestyle: `본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다.`,
    },
  },
  {
    id: 3,
    date: '2024년 5월 15일 (수)',
    time: '13:56분',
    score: 24,
    percentage: 73,
    diagnosis: `본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다.`,
    helpfulPrograms: {
      eating: `본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다`,
      lifestyle: `본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다.`,
    },
  },
  {
    id: 4,
    date: '2024년 5월 15일 (수)',
    time: '13:56분',
    score: 24,
    percentage: 73,
    diagnosis: `본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다.`,
    helpfulPrograms: {
      eating: `본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다`,
      lifestyle: `본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다. 홍길동 님은 현재 신체적으로 건강한 상태이며, 모든 주요 건강 지표가 정상 범위 내에 있습니다. 정기적인 운동과 균형 잡힌 식단을 유지하며, 연간 건강 검진을 계속해서 받을 것을 권장합니다.
본 건강진단 레포트는 홍길동 님의 일반적인 건강 상태와 주요 건강 지표를 종합적으로 분석한 결과를 담고 있습니다.`,
    },
  },
];
